/******************************************************************************/
//	カードゲーム
//		ヘッダファイル
/******************************************************************************/

#ifndef	__Main_H__
#define	__Main_H__

//----------------------------------------------------------------------------//
//	定義
//----------------------------------------------------------------------------//

////////////////////////////////////////
//	メインモードフラグ
enum	E_MainMode
{
	MainModeInit,
	MainModeTitle,
	MainModeMain,
	MainModeEnd,
};

////////////////////////////////////////
//	使用カード数(1〜9)
#define	DEF_USE_CARD_NUMBER	5
//	同名カード数
#define	DEF_USE_SAME_NAME	2

////////////////////////////////////////
//	山札最大数
#define	CARD_MAX	(DEF_USE_CARD_NUMBER*CARD_COLOR_MAX*DEF_USE_SAME_NAME)

//	ネクストカード最大数
#define	NEXT_CARD_MAX	3

//	矢印最大数
#define	ARROW_MAX		12

////////////////////////////////////////
//	デバッグフラグ
//#define	__DEBUG__

#endif	// __Main_H__
