/******************************************************************************/
//	DirectX9ライブラリ
//		テクスチャ
/******************************************************************************/

#ifndef	__Dx9LibTexture_H__
#define	__Dx9LibTexture_H__

//----------------------------------------------------------------------------//
//	構造体
//----------------------------------------------------------------------------//

//	テクスチャ用構造体
typedef	struct
{
	UChar				Use;			//	使用フラグ
	long				Width,Height;	//	サイズ
	long				CenterX;		//	中心座標X
	long				CenterY;		//	中心座標Y
	LPDIRECT3DTEXTURE9	lpTex;			//	テクスチャオブジェクト
}ST_TextureInfo;

#endif	//	__Dx9LibTexture_H__

//----------------------------------------------------------------------------//
//	グローバル変数
//----------------------------------------------------------------------------//
extern	ST_TextureInfo		TEX[TEX_MAX];

//----------------------------------------------------------------------------//
//	プロトタイプ宣言
//----------------------------------------------------------------------------//
extern	void	InitTexture( long TexNo );
extern	void	InitTextureAll( void );
extern	bool	LoadTexture( long TexNo, char *file );
extern	void	ReleaseTexture( void );
