/******************************************************************************/
//	DirectX9ライブラリ
//		構成ファイル管理
/******************************************************************************/

//----------------------------------------------------------------------------//
//	インクルード
//----------------------------------------------------------------------------//
#include	"./Dx9Lib.h"



/******************************************************************************/
//	名前	：	コンストラクタ
//	説明	：	なし
//	戻り値	：	なし
//	引数	：	なし
//	備考	：	なし
/******************************************************************************/
CDx9LibIni::CDx9LibIni()
{
	memset( m_FilePath, 0x00, MAX_PATH );
}

/******************************************************************************/
//	名前	：	コンストラクタ
//	説明	：	なし
//	戻り値	：	なし
//	引数	：	[IN]char	*FilePath	iniファイルのパス
//	備考	：	内部で「Initialize」を呼んでいる
/******************************************************************************/
CDx9LibIni::CDx9LibIni(char *FilePath)
{
	memset( m_FilePath, 0x00, MAX_PATH );
	this->Initialize( FilePath );
}

/******************************************************************************/
//	名前	：	デストラクタ
//	説明	：	なし
//	戻り値	：	なし
//	引数	：	なし
//	備考	：	なし
/******************************************************************************/
CDx9LibIni::~CDx9LibIni()
{
}

/******************************************************************************/
//	名前	：	構成ファイル読み込み
//	説明	：	構成ファイルを読み込む
//	戻り値	：	なし
//	引数	：	[IN]char	*FilePath	iniファイルのパス
//	備考	：	なし
/******************************************************************************/
void	CDx9LibIni::Initialize( char *FilePath )
{
	strcpy_s( m_FilePath, MAX_PATH, g_ExePath );
	strcat_s( m_FilePath, MAX_PATH, "\\" );
	strcat_s( m_FilePath, MAX_PATH, FilePath );

}

/******************************************************************************/
//	名前	：	値取得
//	説明	：	iniファイルの値を取得する
//	戻り値	：	string	iniファイルの値
//	引数	：	[IN]char	*Section	セクション
//				[IN]char	*Key		キー
//	備考	：	なし
/******************************************************************************/
string	CDx9LibIni::GetValueString( char *Section, char *Key )
{
	char	Value[MAX_PATH];
	memset( &Value, 0x0, MAX_PATH );
	GetPrivateProfileString( Section, Key, "0", Value, 1024, m_FilePath );
	return Value;
}

/******************************************************************************/
//	名前	：	値取得
//	説明	：	iniファイルの値を取得する
//	戻り値	：	int	iniファイルの値
//	引数	：	[IN]char	*Section	セクション
//				[IN]char	*Key		キー
//	備考	：	なし
/******************************************************************************/
int	CDx9LibIni::GetValueInt( char *Section, char *Key )
{
	return GetPrivateProfileInt( Section, Key, NOT, m_FilePath );
}
