/******************************************************************************/
//	ムーブライブラリ
//		ヘッダファイル
/******************************************************************************/

#ifndef	__Dx9LibMove_H__
#define	__Dx9LibMove_H__

//----------------------------------------------------------------------------//
//	定義
//----------------------------------------------------------------------------//

//	ムーブデータ最大数
#define	MOV_MAX		100

//	各インデックスサイズ
#define	MOV_INDEX_SIZE		(2+2+2)

//	フラグ
enum
{
	MOVE_LOOP = 0,	//	ループ
	MOVE_STOP,		//	停止
	MOVE_END,		//	終了
};

//----------------------------------------------------------------------------//
//	構造体
//----------------------------------------------------------------------------//

////////////////////////////////////////
//	ムーブ用フレーム構造体
typedef	struct
{
	long			Time;			//	フレーム時間
	double			InitX,InitY;	//	初期座標
	double			PosX,PosY;		//	表示座標
	short			MoveX,MoveY;	//	移動量
}ST_MoveFrame;

////////////////////////////////////////
//	ムーブ用構造体
typedef	struct
{
	UChar			Use;			//	使用フラグ
	UChar			ExecFlag;		//	フラグ（0:ループ、1:停止、2:終了）
	UChar			State;			//	状態（0:停止、1:再生中）

	long			FrameMax;		//	フレームの最大数
	long			FrameNo;		//	フレーム番号
	long			DataNo;			//	データ番号
	long			PolNo;			//	ポリゴン番号

	long			TimeCount;		//	タイムカウンタ
	ST_MoveFrame	FRM;			//	フレームデータ(カレントデータ)
	char			*DataAddr;		//	ムーブデータのアドレス
}ST_MoveData;

#endif	//	__Dx9LibMove_H__

//----------------------------------------------------------------------------//
//	グローバル変数
//----------------------------------------------------------------------------//
extern	ST_MoveData	MOV[MOV_MAX];

//----------------------------------------------------------------------------//
//	プロトタイプ宣言
//----------------------------------------------------------------------------//
extern	void	InitMoveAll( void );
extern	void	InitMove( long MoveNo );
extern	void	LoadMoveFile( char *FileName, char *LoadBuf );
extern	void	SetMove( long MoveNo, long PolNo, long DataNo, char *DataAddr );
extern	void	LoopMove( void );
