/******************************************************************************/
//	オブジェクト用ファイル
//		ソースファイル
/******************************************************************************/

#ifndef	__CharControl_H__
#define	__CharControl_H__

//----------------------------------------------------------------------------//
//	定義
//----------------------------------------------------------------------------//

//	ユニット最大数
#define	UNIT_MAX	4

//----------------------------------------------------------------------------//
//	構造体
//----------------------------------------------------------------------------//

/////////////////////////////////////////////////
//	ユニット用
typedef	struct
{
	long	obj_no;		//	オブジェクト番号

	RECT	pat;		//	パターンサイズ
	short	cx,cy;		//	中心座標
	short	hit_rect;	//	当たり範囲
	short	buzz_rect;	//	バズリ範囲
	short	touch;		//	接触範囲
	double	speed;		//	移動速度

	long	shot[5];	//	ショット番号
	long	but_no;		//	ショットフラグ(0:押してない、1:ノーマル、2:特殊１、3:特殊２、4:ＥＸ１、5:ＥＸ２)

	long	life;		//	ライフ
	long	gage;		//	ゲージ
}UNIT_TBL;

#endif	//	__CharControl_H__

//----------------------------------------------------------------------------//
//	外部宣言
//----------------------------------------------------------------------------//
extern	UNIT_TBL	UNIT[2];

//----------------------------------------------------------------------------//
//	プロトタイプ宣言
//----------------------------------------------------------------------------//

//	キャラクター初期化
extern	void	CharInit( short char_no, short unit_no );
//	キャラクターメインループ
extern	void	CharMainLoop( void );
//	キャラクター移動処理
extern	void	CharMove( void );
//	キャラクター同士の当たり判定
extern	void	CharHitChk( void );
//	向き判定
extern	void	CharTurn( OBJ_TBL *obj1, OBJ_TBL *obj2 );
