/******************************************************************************/
//	オプションメイン
//		ヘッダファイル
/******************************************************************************/

#ifndef	__Option_H__
#define	__Option_H__

//----------------------------------------------------------------------------//
//	定義
//----------------------------------------------------------------------------//
enum
{
	//	テクスチャ番号
	TEX_OPTION_BG = 0,
	TEX_OPTION_SYS,

	//	パターン番号
	PAT_OPTION_BG = 0,
	PAT_OPTION_ICON,

	//	ポリゴン番号
	POL_OPTION_BG = 0,
	POL_OPTION_ICON,

	//	オブジェクト番号
	OBJ_OPTION_BG = 0,
	OBJ_OPTION_ICON,
};

#endif	//	__Option_H__

//----------------------------------------------------------------------------//
//	プロトタイプ宣言
//----------------------------------------------------------------------------//
extern	void	OptionInit( void );	//	オプション初期化
extern	void	OptionMain( void );	//	オプションメイン
