/******************************************************************************/
//	オブジェクト用ファイル
//		ソースファイル
/******************************************************************************/

#ifndef	__CharControl_H__
#define	__CharControl_H__

#include	"./ObjectMng.h"

//----------------------------------------------------------------------------//
//	構造体
//----------------------------------------------------------------------------//

////////////////////////////////////////
//	ユニット用
typedef	struct
{
	long	ObjectNo;			//	オブジェクト番号

	RECT	PatSize;			//	パターンサイズ
	short	CenterX,CenterY;	//	中心座標
	short	HitRect;			//	当たり範囲
	double	Speed;				//	移動速度

	long	Shot[5];			//	ショット番号
	//	ショットフラグ
	//	(0:押してない、1:ノーマル、2:特殊１、3:特殊２、4:ＥＸ１、5:ＥＸ２)
	long	ButNo;
	long	ShotFlag;
	long	ShotLv;				//	ショットレベル

	long	Life;				//	ライフ
	long	LockEnemy;			//	攻撃対象の敵
}UNIT_TBL;

#endif	//	__CharControl_H__

//----------------------------------------------------------------------------//
//	外部宣言
//----------------------------------------------------------------------------//
extern	UNIT_TBL	UNIT;

//----------------------------------------------------------------------------//
//	プロトタイプ宣言
//----------------------------------------------------------------------------//
extern	void	CharInit( void );
extern	void	CharMainLoop( void );
extern	void	CharMove( void );
extern	void	CharHitChk( void );
extern	void	CharTurn( long ObjNo1, long ObjNo2 );
